from aiogram import types

# TEXT

text_inline_start = '''
                Всем привет!\n\n
Данный бот, является ботом портфолио,
который показывает несколько простых
задач, которые можно реализовать в
Телеграм.\n
Например, вам нужно запланировать
напоминания? Этот бот поможет вам,
позволяя создавать списки дел.\n
Так же, здесь есть пробная версия оплаты,
Нужно всего лишь перейти на
соответствующую вкладку и пройти к
оплате.
Оплата является тестовой, Деньги
списываются с ВИРТУАЛЬНОГО СЧЁТА\n
Ну и относительно новая функция в 
Телеграмм, под названием WEBAPP. Её 
функционал вы также сможете опробовать 
в данном боте'''
text_inline_about = '''         
        Немного о себе\n\n
Создаю Telegram-ботов, есть
как простые проекты (отправка
нескольких видео последовательно), так и
сложные (бот для ведущего игры
«Мафия»).\n
Сначала это было больше как хобби,
теперь работаю полноценно над
проектами, которые зарождаются в
головах моих клиентов.\n
Если вдруг заинтересовались созданием
своего бота, ниже будет ссылка на мой
профиль'''
text_inline_command_about = 'Что-то тут, что-то там, камац камац'
text_inline_message_warning = 'Чтобы не засорять чат, я удалю ваше сообщение через 5 секунд'
text_inline_payment ='''
    Пробная оплата любых вещей\n\n
Здесь вы можете проверить работу
интернет-эквайринга через Telegram
для того, чтобы провести пробную
оплату, нажмите на кнопку ниже.\n
Бот попросит добавить карту, все данные
пробной карты уже будут указаны,
ничего менять не нужно.
После чего, проведите оплату.\n
Через телеграмм можно подключить
разные интернет-эквайринги, их список
постоянно расширяется.'''
text_callback_other = 'Вы можете купить что-то другое, но суть показана в предыдушей кнопке'
text_invoice_title = 'Оплата подписки (Деньги не спишуться, счёт тестовый)'
text_invoice_description = 'Вы оплачиваете какую-то подписку. Проверьте заказ, если всё верно, можете продолжать оплату'
text_plan_main = '''
            Крутой задачник\n\n
Здесь можно попробовать задачник. Пока
здесь нет многих функций, но со временем
он будет улучшаться.
\nВ начале нужно добавить группу с задачами,
после чего, в самой группе добавить дело.
Чтобы добавить группу, нажмите на кнопку 
"Показать мой список задач", после чего 
нужно написать «/create Новое Дело»
\nЧтобы добавить задачу, просто напишите
название задачи в созданном списке дел
Для удаления группы, пишем «/delete
Существующее Дело»
\nДля удаления задачи, напишите номер задачи,
которое нужно удалить'''
text_plan_list = 'Для создания нового списка задача используйте команду\n/create Новый список задач\nДля удаления списка задач используйте команду\n/delete Название списка задач'
text_plan_warning = 'Для создания задачи или дела, в начале нажмите на кнопку "Показать мой список задач"'
text_web = '''
        WEB приложение в Телеграмм\n\n
Здесь вы можете наблюдать за интересной 
функцией в Телеграмм, которой мало кто 
пользуется из-за сложности реализации, 
но она является довольно гибкой по своей 
сути, что позволяет создавать невероятные 
проекты.\n
Один из таких проектов вы можете 
попробовать, нажав на кнопку ниже.
Данное приложение создано самим Телеграмом. 
Оно неплохо передаёт всю суть встроенных 
приложений в Телеграмм.'''
text_FF = 'FF'


